Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Keyboard hotkeys are still in effect while an Input is in progress, but cannot activate if any of the required modifier keys are suppressed, or if the hotkey uses the reg method and its suffix key is suppressed.
ja: キーボードホットキーは、入力中も有効ですが、必要な修飾キーが抑制されている場合、またはホットキーがregメソッドを使用し、そのサフィックスキーが抑制されている場合は、有効にすることができません。

source: Keyboard Navigation
ja: キーボードナビゲーション

source: Keyboard and mouse:
ja: キーボードとマウス：

source: Keyboard events are passed to each Input in order of most recently started to least.
ja: キーボードイベントは、最近開始されたものから順に各Inputに渡されます。

source: Keyboard hotkeys which do not require the hook will use the reg method even if the InstallKeybdHook function is used.
ja: フックを必要としないキーボードホットキーは、InstallKeybdHook関数が使用されていても、regメソッドを使用します。

source: Keyboard or mouse hardware which sends input events more rapidly than the typical key-repeat rate.
ja: キーボードやマウスのハードウェアで、一般的なキーリピート速度よりも高速に入力イベントを送信します。

source: Keyboard or mouse input is typically buffered (delayed) until expression evaluation completes or times out.
ja: キーボードやマウスの入力は、通常、式の評価が完了するかタイムアウトするまでバッファリング（遅延）されます。

source: Keyboard, Mouse, Hotkeys and Hotstrings
ja: キーボード、マウス、ホットキー、ホットストリング

source: Keys and their mysterious symbols
ja: キーとその不思議なシンボル

source: Keys are either suppressed (blocked) or not depending on the following factors (in order):
ja: キーは、以下の要素（順番）により、抑制（ブロック）されるか、されないかが決まります：

source: Keys can be strings, integers or objects, while values can be of any type.
ja: キーは文字列、整数、オブジェクトのいずれでもよく、値はどのような型でもよい。

source: Keys can get "stuck down" if you send a key-down and don't send a key-up.
ja: キーダウンを送ってキーアップを送らない場合、キーが「スタックダウン」することがあります。

source: Keyword Constants
ja: キーワード定数

source: Keywords contains and in are reserved for future use.
ja: キーワードcontainsと inは将来の使用のために予約されています。

source: Known Limitations
ja: 既知の制限事項

source: Known Limitations:
ja: 既知の制限：

source: Known limitation:
ja: 既知の制限：

source: Known limitation: "not ready" also occurs when the drive contains a DVD rather than a CD.
ja: 既知の制限：「not ready」は、ドライブにCDではなくDVDが入っている場合にも発生します。

source: Known limitation: BackgroundTrans might not work properly for controls inside a Tab control that contains a ListView.
ja: 既知の制限：ListViewを含むTabコントロール内のコントロールで、BackgroundTransが正しく動作しない場合がある。

source: Known limitation: If the Wait parameter is not used, the system might consider the playing file to be "in use" until the script closes or until another file is played (even a nonexistent file).
ja: 既知の制限：Waitパラメータを使用しない場合、スクリプトが終了するまで、または別のファイル（存在しないファイルでも可）が再生されるまで、システムは再生中のファイルを「使用中」とみなす可能性がある。

source: Known limitation: If the first control in the window is disabled (possibly depending on control type), the Escape event will not be launched.
ja: 既知の制限：ウィンドウの最初のコントロールが無効になっている場合（コントロールの種類によって異なる可能性があります）、Escapeイベントは起動されません。

source: Known limitation: On some systems in Java applications, hotstrings might interfere with the user's ability to type diacritical letters (via dead keys).
ja: 既知の制限：Javaアプリケーションの一部のシステムでは、ホットストリングが、（デッドキーによって）ユーザーがダイアクリティカル文字を入力する能力を妨害する可能性があります。

source: Known limitation: When compiling a script, variables are evaluated by the compiler and may differ from what the script would return when it is finally executed.
ja: 既知の制限：スクリプトをコンパイルする際、変数はコンパイラによって評価され、最終的に実行されたときにスクリプトが返す値とは異なる場合があります。

source: Known limitations:
ja: 既知の制限事項：

source: Korean
ja: 韓国語

source: L = REPARSE_POINT (typically a symbolic link)
ja: L = REPARSE_POINT（通常はシンボリックリンク）

source: LButton and RButton correspond to the primary and secondary mouse buttons.
ja: LButtonとRButtonは、マウスのプライマリボタンとセカンダリボタンに対応します。

source: LControl & F1::return ; Make left-control a prefix by using it in front of "&" at least once.
ja: LControl & F1::return ; 少なくとも1回は「&」の前に使うことで、left-controlを接頭辞とします。

source: LControl (or LCtrl)
ja: LControl（またはLCtrl）

source: LEFT, RIGHT, MIDDLE (or just the first letter of each of these).
ja: LEFT、RIGHT、MIDDLE（またはそれぞれの頭文字のみ）。

source: LV := MyGui.Add("ListView", "h200 w180", ["Icon & Number","Description"]) ; Create a ListView.
ja: LV := MyGui.Add("ListView", "h200 w180", ["Icon & Number", "Description"]) ; ListViewを作成します。

source: LV, TV and SB functions
ja: LV、 TV、SB関数

source: LV.Modify(0, "Select") ; Select all.
ja: LV.Modify(0, "Select") ; 全て選択

source: LV.ModifyCol ; There are no parameters in this mode.
ja: LV.ModifyCol ; このモードではパラメータはありません。

source: LV.SetImageList(ImageListID) ; Assign the above ImageList to the current ListView.
ja: LV.SetImageList(ImageListID) ; 上記ImageListを現在のListViewに割り当てる。

source: LV.Delete(RowNumber) ; Clear the row from the ListView.
ja: LV.Delete(RowNumber) ; ListViewから行を消去します。

source: LV.Modify(0, "-Check") ; Uncheck all the checkboxes.
ja: LV.Modify(0, "-Check") ; 全てのcheckboxesを外します。

source: LV.Modify(0, "-Select") ; De-select all.
ja: LV.Modify(0, "-Select") ; 全てを選択から外します。

source: LV.Modify(A_Index, "Select") ; Select each row whose first field contains the filter-text.
ja: LV.Modify(A_Index, "Select") ; 最初のフィールドがフィルターテキストを含む各行を選択します。

source: LV.ModifyCol("Hdr") ; Auto-adjust the column widths.
ja: LV.ModifyCol("Hdr") ; 列幅を自動調整する。

source: LV.ModifyCol() ; Auto-size each column to fit its contents.
ja: LV.ModifyCol() ;各カラムを内容に合わせて自動サイズアップする。

source: LV.ModifyCol(3, 60) ; Make the Size column at little wider to reveal its header.
ja: LV.ModifyCol(3, 60) ;Size列を少し広くして、ヘッダーを見せる。

source: LV.Opt("+Icon") ; Switch to icon view.
ja: LV.Opt("+Icon") ;アイコン表示に切り替えます。

source: LV.Opt("+Redraw") ; Re-enable redrawing (it was disabled above).
ja: LV.Opt("+Redraw") ; 再描画を有効にする（上記では無効になっている）。

source: LV.Opt("+Report") ; Switch back to details view.
ja: LV.Opt("+Report") ; 詳細ビューに切り替えます。

source: LV.Opt("-Redraw") ; Improve performance by disabling redrawing during load.
ja: LV.Opt("-Redraw") ; ロード中の再描画を無効にすることでパフォーマンスを向上させる。

source: LV/TV.Add/Modify now suppress item-change events, so such events should only be raised by user action or SendMessage.
ja: LV/TV.Add/Modifyはアイテムチェンジイベントを抑制するようになりましたので、そのようなイベントはユーザーアクションまたはSendMessageによってのみ発生します。

source: LV/TV/SB functions were replaced with methods (of the control object), making it much easier to use multiple ListViews/TreeViews.
ja: LV/TV/SBの関数が（コントロールオブジェクトの）メソッドに置き換えられ、複数のListView/TreeViewの利用がより容易になりました。

source: Label names are now required to consist only of letters, numbers, underscore and non-ASCII characters (the same as variables, functions, etc.).
ja: ラベル名は、文字、数字、アンダースコア、非ASCII文字（変数、関数などと同じ）のみで構成することが求められるようになりました。

source: Labels
ja: ラベル

source: Labels - Syntax & Usage | AutoHotkey v2
ja: ラベル - 構文と使用法｜AutoHotkey v2

source: Labels and function names are no longer supported.
ja: ラベルや関数名はサポートされなくなりました。

source: Labels are aligned with the left edge of each fixed-width tab; that is, the label is displayed immediately to the right of the icon instead of being centered.
ja: つまり、ラベルは中央ではなく、アイコンのすぐ右に表示される。

source: Labels are not supported, only function objects.
ja: ラベルはサポートされておらず、ファンクションオブジェクトのみです。

source: Labels defined in a function have local scope; they are visible only inside that function and do not conflict with labels defined elsewhere.
ja: 関数内で定義されたラベルはローカルスコープを持ち、その関数内でのみ表示され、他の場所で定義されたラベルと衝突することはありません。

source: Labels identify a line of code, and can be used as Goto targets or to specify a loop to break out of or continue.
ja: ラベルはコード行を識別するもので、Gotoターゲットとして使ったり、ループから抜けたり続行したりするループを指定したりすることができる。

source: Language
ja: 言語

source: Language Codes
ja: 言語コード

source: Language Codes | AutoHotkey v2
ja: 言語コード｜AutoHotkey v2

source: Large
ja: 大きい

source: Last Found Window
ja: ラストファウンドウィンドウ

source: Later (when the time comes to cancel or destroy the owned window), re-enable the owner via MyGui.Opt("-Disabled").
ja: 後で（所有するウィンドウをキャンセルしたり破棄するとき）、MyGui.Opt("-Disabled")で所有者を再有効化します。

source: Later, use the word Up (or the letter U) to release the mouse button.
ja: その後、Up（またはUの文字）という単語を使ってマウスボタンを離します。

source: Later, when a group is used by a function such as GroupActivate, each window on the desktop is checked against each of these criteria.
ja: その後、GroupActivateなどの機能でグループが使用されると、デスクトップ上の各ウィンドウがこれらの各条件に照合されます。

source: Later, when the compiled script EXE runs and the call to FileInstall is executed, the file is extracted from the EXE and written to the location specified by Dest.
ja: その後、コンパイルされたスクリプトEXEが実行され、FileInstallの呼び出しが実行されると、EXEからファイルが抽出され、Destで指定された場所に書き込まれます。

source: Later, when the compiled script is executed, the included file is extracted to another location with another name.
ja: その後、コンパイルされたスクリプトが実行されると、インクルードされたファイルは別の場所に別の名前で展開されます。

source: Later, when the script becomes interruptible again, any overdue timer will run once as soon as possible and then resume its normal schedule.
ja: その後、スクリプトが再び中断可能になると、期限を過ぎたタイマーはできるだけ早く1回実行し、その後通常のスケジュールを再開します。

source: Latin
ja: ラテン語

source: Latin, Greek, Cyrillic
ja: ラテン、ギリシャ、キリル

source: Launch Target minimized or maximized.
ja: 起動したTargetを最小化または最大化します。

source: Launch AutoHotkey /Debug.
ja: AutoHotkey /Debugを起動します。

source: Launch Calculator
ja: 電卓を起動します

source: Launch My Computer
ja: マイコンピュータを起動する

source: Launch Notepad++.
ja: Notepad++を起動します。

source: Launch Settings
ja: 起動設定

source: Launch This PC (formerly My Computer or Computer)
ja: PCを開きます。（以前のマイコンピュータまたはコンピュータ）

source: Launch XDebugClient.
ja: XDebugClientを起動します。

source: Launch default e-mail program
ja: デフォルトのメールソフトを起動します

source: Launch default media player
ja: デフォルトのメディアプレーヤーを起動します

source: Launch media player
ja: メディアプレーヤーの起動

source: Launch settings: Configure the launcher.
ja: Launch settings：ランチャーを設定する。

source: Launch the browser and go to the home page
ja: ブラウザを起動し、トップページに移動する

source: Launch the email application
ja: メールアプリケーションを起動する

source: Launch unconditionally, skipping any warning dialogs.
ja: 無条件に起動し、警告ダイアログをスキップする。

source: Launch user app1
ja: ユーザーアプリ1起動

source: Launch user app2
ja: ユーザーアプリ2起動

source: Launched when the user or another program attempts to close the window, such as by pressing the X button in its title bar, selecting "Close" from its system menu, or calling WinClose.
ja: ユーザーまたは他のプログラムが、タイトルバーのXボタンを押す、システムメニューから「閉じる」を選択する、またはWinCloseを呼び出すなどして、ウィンドウを閉じようとしたときに起動されるものです。

source: Launched when the user presses Esc while the GUI window is active.
ja: GUIウィンドウがアクティブな状態で、ユーザーがEscを押したときに起動されます。

source: Launched when the window is resized, minimized, maximized, or restored.
ja: ウィンドウのサイズ変更、最小化、最大化、復元時に起動されます。

source: Launched whenever files/folders are dropped onto the window as part of a drag-and-drop operation (but if this callback is already running, drop events are ignored).
ja: ドラッグ＆ドロップ操作でファイルやフォルダがウィンドウにドロップされるたびに起動します（ただし、このコールバックがすでに実行されている場合、ドロップイベントは無視されます）。

source: Launched whenever the user right-clicks anywhere in the window except the title bar and menu bar.
ja: タイトルバーとメニューバーを除くウィンドウ内の任意の場所を右クリックしたときに起動します。

source: Launcher
ja: ランチャー

source: Launches Notepad, sets its priority to "High" and shows its current PID.
ja: メモ帳を起動し、ProcessSetPriority "High"に設定し、現在のPIDを表示します。

source: Launches an instance of Internet Explorer and connects events to corresponding script functions with the prefix "IE_".
ja: Internet Explorerのインスタンスを起動し、接頭辞「IE_」を持つ対応するスクリプト関数にイベントを接続します。

source: Launches an instance of Internet Explorer, makes it visible and navigates to a website.
ja: Internet Explorerのインスタンスを起動し、表示させ、Webサイトへ移動することができます。

source: Leading and trailing spaces and tabs are allowed.
ja: 先頭および末尾のスペースとタブは使用可能です。

source: Leading indentation is stripped out,
ja: 先頭のインデントが取り除かれます。

source: Learn advanced hotkey features such as using any keys as modifiers or automating game actions on the screen.
ja: 任意のキーをモディファイアとして使用したり、画面上でゲームのアクションを自動化するなど、高度なホットキー機能を学ぶことができます。

source: Learn details about creating, editing and running a script, the tray icon, the main window, command line usage, portability and installer options.
ja: スクリプトの作成、編集、実行、トレイアイコン、メインウィンドウ、コマンドラインの使用方法、移植性、インストーラーオプションの詳細について説明します。

source: Learn details about functions in general, parameters, returning values, built-in functions, variadic functions, etc.
ja: 関数全般、パラメータ、戻り値、組み込み関数、変種関数などの詳細を説明します。

source: Learn details about hotkeys in general, modifier symbols, context-sensitive hotkeys, custom combinations, mouse wheel hotkeys, function hotkeys, etc.
ja: 一般的なホットキー、修飾記号、文脈依存型ホットキー、カスタムコンビネーション、マウスホイールホットキー、ファンクションホットキーなどの詳細について説明します。

source: Learn details about hotstrings in general, ending characters, options, long replacements, context-sensitive hotstrings, function hotstrings, etc.
ja: ホットストリング全般、エンディングキャラクター、オプション、ロングリプレイスメント、文脈依存型ホットストリング、関数ホットストリングなどについての詳細を説明します。

source: Learn details about scripts in general, splitting long lines, compiling a script, passing command line parameters, codepage and debugging.
ja: スクリプト全般、長い行の分割、スクリプトのコンパイル、コマンドラインパラメータの渡し方、コードページ、デバッグについて詳しく学ぶ。

source: Learn details about some general concepts and conventions used by AutoHotkey, with focus on explanation rather than code.
ja: AutoHotkeyで使用される一般的な概念や慣習について、コードよりも説明に重点を置いて詳しく説明します。

source: Learn details about the GNU General Public License v2 used by AutoHotkey.
ja: AutoHotkeyで使用されているGNU General Public License v2の詳細についてはこちらをご覧ください。

source: Learn details about the language such as comments, expressions, control flow statements, structure of a script, etc.
ja: コメント、式、制御フロー文、スクリプトの構造など、言語に関する詳細を学ぶことができます。

source: Learn details about variables, expressions, operators, built-in variables and capacity and memory of variables.
ja: 変数、式、演算子、組み込み変数、変数の容量とメモリについて詳しく説明します。

source: Learn how long paths are handled in AutoHotkey and which techniques are available to bypass path length limitations.
ja: AutoHotkeyで長いパスがどのように扱われるのか、また、パスの長さの制限を回避するにはどのようなテクニックがあるのかをご紹介します。

source: Learn how to activate or manipulate windows.
ja: ウィンドウをアクティブにしたり、操作したりする方法を紹介します。

source: Learn how to control Winamp via hotkey even when it is minimized or inactive.
ja: Winampを最小化または非アクティブの状態でもホットキーでコントロールする方法をご紹介します。

source: Learn how to download and install AutoHotkey, to create a script, to use hotkeys and hotstrings, to send keystrokes, to run programs, etc.
ja: AutoHotkeyのダウンロードとインストール方法、スクリプトの作成方法、ホットキーとホットストリングの使用方法、キー入力の送信方法、プログラムの実行方法などをご紹介します。

source: Learn how to install AutoHotkey.
ja: AutoHotkeyのインストール方法について説明します。

source: Learn how to make controller buttons or other controls send keystrokes or mouse clicks.
ja: コントローラのボタンやその他のコントロールにキーストロークやマウスクリックを送信させる方法を学びます。

source: Learn how to maximize the performance of a script and which internal optimizations are processed in favor of performance.
ja: スクリプトのパフォーマンスを最大化する方法と、パフォーマンスを優先して処理される内部最適化について学びます。

source: Learn how to override or disable built-in Windows hotkeys.
ja: Windowsに内蔵されているホットキーを無効にする方法をご紹介します。

source: Learn how to override or disable hotkeys owned by Windows or another application.
ja: ウィンドウズやほかのアプリケーションのホットキーを上書きしたり無効にしたりする方法を学びます。

source: Learn how to run example code with AutoHotkey.
ja: AutoHotkeyでサンプルコードを実行する方法をご紹介します。

source: Learn how to run programs with AutoHotkey.
ja: AutoHotkeyでプログラムを実行する方法をご紹介します。

source: Learn how to send keystrokes or text with AutoHotkey.
ja: AutoHotkeyでキーストロークやテキストを送信する方法についてご紹介します。

source: Learn how to send messages to a window or its controls using the PostMessage or SendMessage functions.
ja: PostMessage関数やSendMessage関数を使用して、ウィンドウやそのコントロールにメッセージを送信する方法について説明します。

source: Learn how to write hotkeys.
ja: ホットキーの書き方について説明します。

source: Learning takes time, the "pros" you encounter did not learn to be masters in just a few hours or days.
ja: 学習には時間がかかる。あなたが出会う「プロ」たちは、ほんの数時間や数日でマスターになったわけではない。

source: Learning to code is often a repetitious process; take some code, make a small change, test the code, rinse and repeat.
ja: コードを学ぶことは、多くの場合、反復的なプロセスです。

source: Least significant bit is set if a network is present; otherwise, it is cleared.
ja: ネットワークが存在する場合は最下位ビットがセットされ、そうでない場合はクリアされる。

source: Leave Format blank to produce the time followed by the long date.
ja: Formatを空白にすると、時刻の後に長い日付が表示されます。

source: Leave blank to allow the function to wait indefinitely.
ja: 無期限に待機させる場合は空白のままにする。

source: Leave this parameter blank to retain the current Delay.
ja: 現在のDelayを保持する場合は、このパラメータを空白にします。

source: Leave this parameter blank to use the current local date and time.
ja: 現在のローカルの日付と時刻を使用する場合は、このパラメータを空白にします。

source: Left (default), Right, Middle (or just the first letter of each of these); or the fourth or fifth mouse button (X1 or X2).
ja: 左（デフォルト）、右、真ん中（またはそれぞれの最初の文字）、またはマウスの4番目か5番目のボタン（X1またはX2）です。

source: Left Alt (technical info:
ja: Left Alt（技術情報：

source: Left Alt (technical info: sends the left virtual key rather than the neutral one)
ja: 左Alt（技術情報：中立キーではなく、左の仮想キーを送信します）

source: Left Alt.
ja: 左Alt。

source: Left Ctrl (technical info:
ja: Left Ctrl（技術情報：

source: Left Ctrl (technical info: sends the left virtual key rather than the neutral one)
ja: 左Ctrl（技術情報：中立キーではなく、左の仮想キーを送信します）

source: Left Ctrl.
ja: 左Ctrl。

source: Left Shift (technical info:
ja: Left Shift（技術情報：

source: Left Shift (technical info: sends the left virtual key rather than the neutral one)
ja: 左Shift（技術情報：中立キーではなく、左の仮想キーを送信します）

source: Left Shift.
ja: 左Shift。

source: Left Win
ja: 左Win

source: Left Win.
ja: 左Win。

source: Left align the result within the given field width (insert spaces to the right if needed).
ja: 指定されたフィールド幅の範囲内で結果を左寄せにする（必要に応じて右側にスペースを挿入します）。

source: Left and Right correspond to the primary button and secondary button.
ja: 左はプライマリーボタン、右はセカンダリーボタンに対応します。

source: Left, Right, Middle (or just the first letter of each of these).
ja: 左、右、真ん中（またはそれぞれの頭文字だけ）。

source: Left-aligns the column's text, which is the initial default for every column.
ja: カラムのテキストを左寄せにします。これは、すべてのカラムの初期設定値です。

source: Left-aligns the text.
ja: テキストを左揃えにする。

source: Left-click at the coordinates 100, 200
ja: 座標100, 200で左クリック

source: Left-justifies the control's text within its available width.
ja: コントロールのテキストを使用可能な幅の範囲内で左寄せにします。

source: Legacy Syntax Removed
ja: レガシーシンタックスの廃止

source: Length limit (e.g. L5).
ja: 長さの制限（例：L5）。

source: Let components be referenced by name and/or index.
ja: コンポーネントを名前とインデックスで参照できるようにします。

source: Let devices be referenced by name-prefix and/or index.
ja: デバイスは、ネームプレフィックスやインデックスで参照できるようにします。

source: Letters and numbers that you want to be transcribed literally from Format into the final string should be enclosed in single quotes as in this example:
ja: Formatから最終的な文字列に文字通りに転写したい文字や数字は、この例のようにシングルクォートで囲む必要があります：

source: Letters and numbers that you want to be transcribed literally from Format into the final string should be enclosed in single quotes as in this example: "'Date:' MM/dd/yy 'Time:' hh:mm:ss tt".
ja: Formatから最終的な文字列に文字通りに転写したい文字や数字は、この例のようにシングルクォートで囲む必要があります："'Date:' MM/dd/yy 'Time:' hh:mm:ss tt"。

source: Library
ja: ライブラリ

source: Light (default)
ja: ライト（初期値）

source: Like SendInput, SendPlay's keystrokes do not get interspersed with keystrokes typed by the user.
ja: SendInputと同様に、SendPlayのキー入力は、ユーザーが入力したキー入力が挟まれることはありません。

source: Like control flow statements, they cannot be used inside an expression.
ja: 制御フロー文と同様に、式の内部で使用することはできません。

source: Like Locale, but digits in the strings are considered as numerical content rather than text.
ja: Localeと似ているが、文字列中の数字はテキストではなく数値コンテンツとみなされる。

source: Like other directives, #ClipboardTimeout cannot be executed conditionally.
ja: 他のディレクティブと同様に、#ClipboardTimeoutは条件付きで実行することはできません。

source: Like other directives, #DllLoad cannot be executed conditionally.
ja: 他のディレクティブと同様に、#DllLoadは条件付きで実行することはできません。

source: Like other directives, #ErrorStdOut cannot be executed conditionally.
ja: 他のディレクティブと同様に、#ErrorStdOutは条件付きで実行することはできません。

source: Like other directives, #HotIf cannot be executed conditionally.
ja: 他のディレクティブと同様に、#HotIfは条件付きで実行することはできません。

source: Like other directives, #HotIfTimeout cannot be executed conditionally.
ja: 他のディレクティブと同様に、#HotIfTimeoutは条件付きで実行することはできません。

source: Like other directives, #Hotstring cannot be executed conditionally.
ja: 他のディレクティブと同様に、#Hotstringは条件付きで実行することはできません。

source: Like other directives, #Include cannot be executed conditionally.
ja: 他のディレクティブと同様に、#Includeは条件付きで実行することはできません。

source: Like other directives, #InputLevel cannot be executed conditionally.
ja: 他のディレクティブと同様に、#InputLevelは条件付きで実行することはできません。

source: Like other directives, #MaxThreads cannot be executed conditionally.
ja: 他のディレクティブと同様に、#MaxThreadsは条件付きで実行することはできません。

source: Like other directives, #MaxThreadsBuffer cannot be executed conditionally.
ja: 他のディレクティブと同様に、#MaxThreadsBufferは条件付きで実行することはできません。

source: Like other directives, #MaxThreadsPerHotkey cannot be executed conditionally.
ja: 他のディレクティブと同様に、#MaxThreadsPerHotkeyを条件付きで実行することはできません。

source: Like other directives, #NoTrayIcon cannot be executed conditionally.
ja: 他のディレクティブと同様に、#NoTrayIcon は条件付きで実行することはできません。

source: Like other directives, #Requires cannot be executed conditionally.
ja: 他のディレクティブと同様に、#Requiresは条件付きで実行することはできません。

source: Like other directives, #SingleInstance cannot be executed conditionally.
ja: 他のディレクティブと同様に、#SingleInstanceは条件付きで実行することはできません。

source: Like other directives, #SuspendExempt cannot be executed conditionally.
ja: 他のディレクティブと同様に、#SuspendExemptは条件付きで実行することはできません。

source: Like other directives, #UseHook cannot be executed conditionally.
ja: 他のディレクティブと同様に、#UseHookは条件付きで実行することはできません。

source: Like other directives, #WinActivateForce cannot be executed conditionally.
ja: 他のディレクティブと同様に、#WinActivateForceを条件付きで実行することはできません。

source: Like the Blind mode, the Text mode ignores SetStoreCapsLockMode (that is, the state of CapsLock is not changed) and does not wait for Win to be released.
ja: ブラインドモードと同様に、テキストモードはSetStoreCapsLockModeを無視し（つまり、CapsLockの状態は変化しない）、Winが解除されるのを待つことはありません。

source: Like the Raw mode, the Text mode causes the following characters to be interpreted literally:
ja: Rawモードと同様に、Textモードでは、以下の文字が文字通りに解釈されます：

source: Like the Raw mode, the Text mode causes the following characters to be interpreted literally: ^+!#{}.
ja: Rawモードと同様に、Textモードでは、以下の文字が文字通りに解釈されます：^+!#{}。

source: Lime
ja: Lime（ライム）

source: Limitations
ja: 制限事項

source: Limitations:
ja: 制限：

source: Limitations: 1) "Up" does not work with controller buttons; and 2) An "Up" hotkey without a normal/down counterpart hotkey will completely take over that key to prevent it from getting stuck down.
ja: 制限：1)「Up」はコントローラーのボタンでは動作しない。2)「Up」ホットキーに対応する通常のホットキー/ダウンホットキーがない場合、そのキーが完全に引き継がれ、押したままになるのを防ぐ。

source: Line 1 is the first line.
ja: 1は最初の行を表します。

source: Line Text:
ja: ラインテキスト：

source: Line breaks are kept
ja: 改行が保持されます

source: Line continuation is now more selective about the context in which a symbol is considered an expression operator.
ja: 行の継続は、記号が式演算子とみなされる文脈について、より選択的になりました。

source: Line continuation now works for expression operators at the end of a line.
ja: 行末の式演算子に対して、行の継続が機能するようになりました。

source: Line endings are still returned to the script as-is by File.Read if EOL translation is not enabled.
ja: EOL変換が有効でない場合、File.Readによって行末がそのままスクリプトに返されます。

source: Lines are merged regardless of whether the line actually contains an expression.
ja: 行が実際に式を含んでいるかどうかに関係なく、行はマージされます。

source: Lines displayed in the main window via ListLines or the menu View->Lines are always numbered according to their physical order within their own files.
ja: メインウィンドウのListLinesまたはメニューのView->Linesで表示されるラインは、常にファイル内の物理的な順序に従って番号付けされます。

source: Lines most recently executed - See ListLines.
ja: 最近実行された行 -ListLinesを参照。

source: Lines starting with ( and ending with : are no longer excluded from starting a continuation section on the basis of looking like a label, as ( is no longer valid in a label name.
ja: (で始まり、:で終わる行は、(がラベル名として有効でなくなったため、ラベルのように見えることを理由に継続セクションの開始対象から除外されなくなりました。

source: Lines that begin with an expression operator (except ++ and --) are merged with the previous line.
ja: 式演算子で始まる行（++と--を除く）は、前の行と統合されます。

source: Lines up to 65,534 characters long can be read.
ja: 最大65,534文字までの行を読み取ることができます。
